# Manipulação utilizando os recursos do Pandas

### Bibliotecas Python

In [1]:
import pandas as pd
import numpy as np

### Cria tabela em Pandas

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Manipulação de valores NaN

In [3]:
#Exclui qualquer linha com valores nulos
df.dropna(axis=0, inplace=False)

     A    B  C
0  1.0  5.0  1

In [4]:
#Exclui qualquer coluna com valores nulos
df.dropna(axis=1, inplace=False)

   C
0  1
1  2
2  3

(inplace=False) não modifica a estrutura do dataframe (df).

(inplace=True) modifica a estrutura do dataframe (df).

In [5]:
#Excluir linhas com no minimo 2 valores
df.dropna(axis=0, thresh=2, inplace=False)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [6]:
#Preenchendo valores NaN
df.fillna(value='XXX', inplace=False)

     A    B  C
0    1    5  1
1    2  XXX  2
2  XXX  XXX  3

In [7]:
df.fillna(value=df['A'].mean(), inplace=False)

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

### Trabalhando com Group by em Pandas

In [8]:
# Novo DataFrame
data = {'Profissão':['Waitress','Music','Music','Scientist','Scientist','Waitress'],
       'Pessoa':['Bernadette','Charlie','Amy','Leonard','Sheldon','Penny'],
       'Salario':[1200,8000,2300,2000,2100,1200]}
df = pd.DataFrame(data)
df

   Profissão      Pessoa  Salario
0   Waitress  Bernadette     1200
1      Music     Charlie     8000
2      Music         Amy     2300
3  Scientist     Leonard     2000
4  Scientist     Sheldon     2100
5   Waitress       Penny     1200

In [9]:
#Forma grupos
df.groupby('Profissão')

In [10]:
#Qual a média de cada grupo
df.groupby('Profissão').mean()

           Salario
Profissão
Music         5150
Scientist     2050
Waitress      1200

In [11]:
#Qual o somatório de cada grupo
df.groupby('Profissão').sum()

           Salario
Profissão
Music        10300
Scientist     4100
Waitress      2400

In [12]:
#Recurso para otimização de grupos
pd.DataFrame(df.groupby('Profissão').describe().loc['Music']).transpose()

      Salario
        count    mean          std     min     25%     50%     75%     max
Music     2.0  5150.0  4030.508653  2300.0  3725.0  5150.0  6575.0  8000.0

In [13]:
pd.DataFrame(df.groupby('Profissão').describe().loc['Scientist']).transpose()

          Salario
            count    mean        std     min     25%     50%     75%     max
Scientist     2.0  2050.0  70.710678  2000.0  2025.0  2050.0  2075.0  2100.0

In [14]:
pd.DataFrame(df.groupby('Profissão').describe().loc[['Music','Scientist']])

          Salario
            count    mean          std     min     25%     50%     75%     max
Profissão
Music         2.0  5150.0  4030.508653  2300.0  3725.0  5150.0  6575.0  8000.0
Scientist     2.0  2050.0    70.710678  2000.0  2025.0  2050.0  2075.0  2100.0

### Concatenando tabelas em Pandas (Concat)

In [15]:
#Criando tabelas para testes
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[0, 1, 2, 3])


df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8,9,10,11])

In [16]:
#concatenação
pd.concat([df1,df2,df3], axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
0    A4   B4   C4   D4
1    A5   B5   C5   D5
2    A6   B6   C6   D6
3    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [17]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0   A4   B4   C4   D4  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1   A5   B5   C5   D5  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2   A6   B6   C6   D6  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

(axis=0) os dados são concatenados um abaixo do outro por causa dos indices

(axis=1) os dados são concatenados ao lado do outro

In [18]:
#concatenado sem valores NaN
pd.concat([df1,df2,df3], axis=1).fillna(value=0, inplace=False)

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0  A4  B4  C4  D4    0    0    0    0
1   A1  B1  C1  D1  A5  B5  C5  D5    0    0    0    0
2   A2  B2  C2  D2  A6  B6  C6  D6    0    0    0    0
3   A3  B3  C3  D3  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

### Mesclando tabelas em Pandas (Merge)

In [27]:
left = pd.DataFrame({'key': ['K0', 'K8', 'K2', 'K3'],
                       'A': ['A0', 'A1', 'A2', 'A3'],
                       'B': ['B0', 'B1', 'B2', 'B3']})

   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [20]:
left

  key   A   B
0  K0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [21]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [22]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [29]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                         'C': ['C0', 'C1', 'C2', 'C3'],
                         'D': ['D0', 'D1', 'D2', 'D3']})

In [26]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [30]:
pd.merge(left, right, how='left',on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Juntando tabelas em Pandas (Join)

In [31]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [32]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [33]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### (Apply)

In [34]:
def testfunc(x):
    if (x> 500):
        return (10*np.log10(x))
    else:
        return (x/10)

In [35]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                   'col2':[444,555,666,444,333,222,666,777,666,555],
                   'col3':'aaa bb c dd eeee fff gg h iii j'.split()})
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j

In [37]:
#Logaritmo neperiando
df['FuncApplied'] = df['col2'].apply(lambda x : np.log(x))
df

   col1  col2  col3  FuncApplied
0     1   444   aaa     6.095825
1     2   555    bb     6.318968
2     3   666     c     6.501290
3     4   444    dd     6.095825
4     5   333  eeee     5.808142
5     6   222   fff     5.402677
6     7   666    gg     6.501290
7     8   777     h     6.655440
8     9   666   iii     6.501290
9    10   555     j     6.318968

In [42]:
df['col3length'] = df['col3'].apply(len)
df

   col1  col2  col3  FuncApplied  col3length
0     1   444   aaa     6.095825           3
1     2   555    bb     6.318968           2
2     3   666     c     6.501290           1
3     4   444    dd     6.095825           2
4     5   333  eeee     5.808142           4
5     6   222   fff     5.402677           3
6     7   666    gg     6.501290           2
7     8   777     h     6.655440           1
8     9   666   iii     6.501290           3
9    10   555     j     6.318968           1

In [44]:
df['sqrt'] = df['FuncApplied'].apply(lambda x: np.sqrt(x))
df

   col1  col2  col3  FuncApplied  col3length      sqrt
0     1   444   aaa     6.095825           3  2.468972
1     2   555    bb     6.318968           2  2.513756
2     3   666     c     6.501290           1  2.549763
3     4   444    dd     6.095825           2  2.468972
4     5   333  eeee     5.808142           4  2.410009
5     6   222   fff     5.402677           3  2.324366
6     7   666    gg     6.501290           2  2.549763
7     8   777     h     6.655440           1  2.579814
8     9   666   iii     6.501290           3  2.549763
9    10   555     j     6.318968           1  2.513756

### Deletando colunas da tabela (Del)

In [45]:
del df['col3length']
df

   col1  col2  col3  FuncApplied      sqrt
0     1   444   aaa     6.095825  2.468972
1     2   555    bb     6.318968  2.513756
2     3   666     c     6.501290  2.549763
3     4   444    dd     6.095825  2.468972
4     5   333  eeee     5.808142  2.410009
5     6   222   fff     5.402677  2.324366
6     7   666    gg     6.501290  2.549763
7     8   777     h     6.655440  2.579814
8     9   666   iii     6.501290  2.549763
9    10   555     j     6.318968  2.513756

### Ordenação (sort_values)

In [46]:
df.sort_values(by='col2')

   col1  col2  col3  FuncApplied      sqrt
5     6   222   fff     5.402677  2.324366
4     5   333  eeee     5.808142  2.410009
0     1   444   aaa     6.095825  2.468972
3     4   444    dd     6.095825  2.468972
1     2   555    bb     6.318968  2.513756
9    10   555     j     6.318968  2.513756
2     3   666     c     6.501290  2.549763
6     7   666    gg     6.501290  2.549763
8     9   666   iii     6.501290  2.549763
7     8   777     h     6.655440  2.579814